{
	"modelTopology": {
	  "keras_version": "2.4.0",
	  "backend": "tensorflow",
	  "model_config": {
		 "class_name": "Sequential",
		 "config": {
			"name": "sequential",
			"layers": [
			  {
				 "class_name": "InputLayer",
				 "config": {
					"batch_input_shape": [null, 2],
					"dtype": "float32",
					"sparse": false,
					"ragged": false,
					"name": "dense_input"
				 }
			  },
			  {
				 "class_name": "Dense",
				 "config": {
					"name": "dense",
					"trainable": true,
					"dtype": "float32",
					"units": 1,
					"activation": "sigmoid",
					"use_bias": true,
					"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}},
					"bias_initializer": {"class_name": "Zeros", "config": {}},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null
				 }
			  }
			]
		 }
	  }
	},
	"format": "layers-model",
	"generatedBy": "Manual for TF.js Logistic Regression",
	"convertedBy": null,
	"weightsManifest": [
	  {
		 "paths": ["group1-shard1of1.bin"],
		 "weights": [
			{"name": "dense/kernel", "shape": [2, 1], "dtype": "float32"},
			{"name": "dense/bias", "shape": [1], "dtype": "float32"}
		 ]
	  }
	]
 }